# OpeningRectDoesnotCutHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OpeningFailures..::..OpeningRectDoesnotCutHost Property
BuiltInFailures..::..OpeningFailures Class See Also
---
Rectangular opening doesn't cut its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpeningRectDoesnotCutHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpeningRectDoesnotCutHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpeningRectDoesnotCutHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OpeningFailures Class
Autodesk.Revit.DB Namespace